import torch
# ------------------------------------------------------------------------
# 演習1 ：7*7の0埋めされたtensorを生成してください

# ここにコードを記述．生成したtensorをx1に代入する


# 生成したtensorの標準出力への表示
print("演習1の解答\n", x1)
# ------------------------------------------------------------------------

# ------------------------------------------------------------------------
# 演習2 ：1*28*28の1で初期化されたtensorを生成してください
# （torch.ones というメソッドがあるので，これを利用してください）

# ここにコードを記述．生成したtensorをx2に代入する


# 生成したtensorの標準出力への表示 & shapeの出力
print("演習2の解答1\n", x2)
print(x2.shape)
# ------------------------------------------------------------------------
